//=============================================================================
//
// 遊び方処理 [manual.h]
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _MANUAL_H_
#define _MANUAL_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "mode.h"

class CManual : public CMode
{
public:
    CManual();
    ~CManual();
    HRESULT Init(void);
    void Uninit(void);
    void Update(void);
};

#endif